In [70]:
import pandas as pd

In [3]:
# Load the CSV file
#data = pd.read_csv("data/o_file_www.csv", sep=';')

<ipython-input-3-5a49fc524576>:2: DtypeWarning: Columns (2,3,5,6,15) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv("/Users/najib/Desktop/Research-Profiling/research-profiling/dblp_dataset/o_file_www.csv", sep=';')

In [155]:
dtype_dict = {   
'id': 'int64',
'author':'string',            
'author-bibtex':'string', 
'cite':'string',  
'crossref':'string',  
'editor':'string', 
'ee':'string',
'key':'string',
'mdate':'string',
'note':'string',
'note-label':'string',
'note-type':'string',
'publtype':'string',
'title':'string',
'url':'string',
'url-type':'string',
'year':'float64'
    }

In [156]:
# Read the CSV file
data = pd.read_csv(
    "data/o_file_www.csv",
    sep=';',          # Specify the delimiter
    dtype=dtype_dict
)

In [18]:
#get data types from a sample to import the whole dataset properly
#data_sample = pd.read_csv("data/o_file_www.csv", sep=';', nrows=100)
#print(data_sample.dtypes)

In [157]:
# List of columns to delete
columns_to_delete = ['author-bibtex','editor','cite','crossref','ee','key','mdate','note-label','publtype','title',
'title','url','url-type','year']

In [158]:
# Drop the specified columns
data.drop(columns=columns_to_delete, inplace=True)

In [159]:
# Drop rows where 'author' is null
data = data.dropna(subset=['author'])

In [160]:
# Drop rows where 'author' is null
data = data.dropna(subset=['note'])

In [161]:
data.rename(columns={'author': 'authors'}, inplace=True)

In [167]:
data.head()

,id,authors,note,note-type
15,3820184,William Seymour,"King's College London, UK",affiliation
19,3820188,Oliver Salazar Celis,"ING Belgium, Brussels, Belgium",affiliation
23,3820192,João Ferreira 0004,"University of Coimbra, Centre for Informatics ...",affiliation
46,3820215,Irina Botan,"ETH Zurich, Switzerland",affiliation
51,3820220,Qing Lu 0008,"Huaiyin Institute of Technology, Faculty of Au...",affiliation

In [168]:
# Split the 'authors', 'note', and 'note-type' columns into lists
data['authors'] = data['authors'].str.split('|')
data['note-type'] = data['note-type'].str.split('|')

In [169]:
# Replace missing values (if any) with empty lists
data['authors'] = data['authors'].apply(lambda x: x if isinstance(x, list) else [])
data['note-type'] = data['note-type'].apply(lambda x: x if isinstance(x, list) else [])

In [170]:
# Ensure both 'authors' and 'note-type' columns have matching lengths
max_lengths = data[['authors', 'note-type']].applymap(len).max(axis=1)
data['authors'] = data['authors'].apply(lambda x, max_len=max_lengths.max(): x + [None] * (max_len - len(x)))
data['note-type'] = data['note-type'].apply(lambda x, max_len=max_lengths.max(): x + [None] * (max_len - len(x)))

In [171]:
# Explode both columns to create one row for each author-note pair
data_exploded = data.explode(['authors', 'note-type'], ignore_index=True)

In [172]:
data_exploded.head()

        id          authors                       note    note-type
0  3820184  William Seymour  King's College London, UK  affiliation
1  3820184             None  King's College London, UK         None
2  3820184             None  King's College London, UK         None
3  3820184             None  King's College London, UK         None
4  3820184             None  King's College London, UK         None

In [173]:
# Drop rows where 'author' is null
data_exploded = data_exploded.dropna(subset=['authors'])

In [174]:
data_exploded.head()

,id,authors,note,note-type
0,3820184,William Seymour,"King's College London, UK",affiliation
12,3820188,Oliver Salazar Celis,"ING Belgium, Brussels, Belgium",affiliation
24,3820192,João Ferreira 0004,"University of Coimbra, Centre for Informatics ...",affiliation
36,3820215,Irina Botan,"ETH Zurich, Switzerland",affiliation
48,3820220,Qing Lu 0008,"Huaiyin Institute of Technology, Faculty of Au...",affiliation

In [175]:
data_exploded = data_exploded.rename(columns={'authors': 'author'})

In [176]:
# Remove digits from the 'author' column using a regular expression
data_exploded['author'] = data_exploded['author'].str.replace(r'\d+', '', regex=True).str.strip()

In [177]:
data_exploded.head()

,id,author,note,note-type
0,3820184,William Seymour,"King's College London, UK",affiliation
12,3820188,Oliver Salazar Celis,"ING Belgium, Brussels, Belgium",affiliation
24,3820192,João Ferreira,"University of Coimbra, Centre for Informatics ...",affiliation
36,3820215,Irina Botan,"ETH Zurich, Switzerland",affiliation
48,3820220,Qing Lu,"Huaiyin Institute of Technology, Faculty of Au...",affiliation

In [179]:
data_exploded.drop_duplicates(inplace=True) #Remove duplications

In [182]:
# Get the number of rows
row_count = data_exploded.shape[0]
print(f"Number of rows: {row_count}")

Number of rows: 191815

In [184]:
new_df = data_exploded.drop(columns=['note-type'])

In [187]:
new_df = new_df.rename(columns={'note': 'affiliation'})

In [188]:
new_df.head()

,id,author,affiliation
0,3820184,William Seymour,"King's College London, UK"
12,3820188,Oliver Salazar Celis,"ING Belgium, Brussels, Belgium"
24,3820192,João Ferreira,"University of Coimbra, Centre for Informatics ..."
36,3820215,Irina Botan,"ETH Zurich, Switzerland"
48,3820220,Qing Lu,"Huaiyin Institute of Technology, Faculty of Au..."

In [191]:
new_df.to_csv("ww_author_affiliation_list.csv", index=False)